{
    "resumeText": "Abhishek Singh\n􀁡 abhisheksingh.engineering@gmail.com 􀈲 (+91) 7088699616 􀁝 connect-with-abhishek\nEXPERIENCE\nSchrodinger. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nSenior Software Developer December 2021 - Present,\nHyderabad\nProjects:\n- Owned and developed multiple user stories for a complex\nReact-based web app, including research, architecture documentation,\nand stakeholder engagement\n- Led TypeScript migration by developing core classes with\ngenerics and modernizing multiple components\n- Migrated a web app from Appsmith to React, ensuring parallel\ndevelopment and granular transformation, resulting in 2x\nloading speed\n- Integrated Storybook and Mock Service Worker (MSW) for\ninteractive component development, testing, and documentation\n- Established Vite app infrastructure with Minikube supporting\nHot Module Replacement, and implemented CI/CD pipelines\nusing GitHub Actions\n- Integrated WebSocket-based data feeds into React components\nfor live updates\nRoles and Responsibilities:\n- Led two sub-teams and managed multiple interns, providing\nmentorship and guidance\n- Engaged with Product Managers and stakeholders to align on\nrequirements, priorities, and roadmap\n- Conducted code reviews and participated in user story and\narchitecture reviews to ensure best standards\nDE Shaw India Private Limited. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nAssociate Developer July 2020 - November 2021,\nHyderabad\n- Developed a Landing Page with React and Java after thorough\nresearch and stakeholder discussions\n- Led a time-sensitive SOW project to integrate a 3D Molecule\nVisualizer Tool into a React application\n- Enhanced test automation by integrating Selenium tests\nBNY Mellon. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nSDE Intern January 2020 - June 2020,\nPune\nRule Engine Design Project\n- Developed a Java-based rule engine for processing tradesrelated\ndata within the company’s system\n- Wrote Unit Tests, used Mutation Testing with PITest to ensure\nrobust validation of business rules and logic with high\ncode coverage\n- Developed Jenkins pipelines for automated build, test, and\ndeployment, integrating test reports for better visibility\nPERSONAL PROJECTS\nCortex-Bot. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n- Algo Trading platform to provide trade suggestions\nusing technical analysis.\n- Able to place trades via a broker, analyze\nand backtest a strategy\n- Tech Stack - React, Vite, Python, FastAPI,\nKubernetes, Prometheus\nSKILLS\nBack End Java, Python, C++\nFront End Javascript, Typescript, React\nTools Vite, Webpack, Rollup\nTesting Selenium, Storybook, Jest\nDevOps Docker, Jenkins, Git, Minikube,\nTilt\nSoft Skills Leadership, communication\nEDUCATION\nNIT Uttarakhand 2020\nB.Tech. in Computer Science\nCGPA: 7.52 / 10.0\nBeersheba Sr. Sec. School 2016\nSenior Secondary | CBSE\nAggregate Percentage: 90.2\nHimalayan Progressive 2014\nHigher Secondary | CBSE\nCGPA: 9.8 / 10.0\nACHIEVEMENTS\n1st Schrodinger Hack Odyssey\nInternal Hackathon • Team of 3\n71st Google Hashcode 2019\n6000+ teams worldwide\n2nd in India • 71st overall\n19th ACM-ICPC 2019-20 Regional\nTop 10 Masterplan - IIMA TRBS 2019\nIdea Pitching • 130+ teams\nLANGUAGES\nEnglish (Fluent) • Hindi (Native)",
    "jobDescription": "About the job\nAbout Highspot\n\nHighspot is a software product development company and a recognized global leader in the sales enablement category, leveraging cutting-edge AI and GenAI technologies at the core of its robust Software-as-a-Service (SaaS) platform. Highspot is revolutionizing how millions of individuals work worldwide. Through its AI-powered platform, Highspot drives enterprise transformation to empower sales teams through intelligent content management, training, contextual guidance, customer engagement, meeting intelligence, and actionable analytics. The Highspot platform delivers advanced features tailored to business needs, in a modern design that sales and marketing executives appreciate and is the #1 rated sales enablement platform on G2 Crowd.\n\nWhile headquartered in Seattle, Highspot has expanded its footprint across America, Canada, the UK, Germany, Australia, and now India, solidifying its presence in the Asia Pacific markets.\n\nAbout The Role\n\nWe are a community of engineers working at the intersection of business software, artificial intelligence, and great design. We are looking to complement our engineering team with a Senior Frontend Software Engineer. As a Highspot Senior Frontend Software Engineer, you will be responsible for all aspects of the software lifecycle – including feature design, architecture, implementation, testing, monitoring, and diagnostics. This is a role that works closely with Product Management, Design, and Backend Engineering teams. Some of the frontend technologies that we use include: JavaScript, HTML5, CSS3, React, Backbone, Underscore, and jQuery.\n\nResponsibilities\n\nDevelop new customer-facing product features\nRecommend and drive frontend infrastructure improvements.\nCollaborate with our UI/UX designers and Product owners to translate product ideas, specifications, and mocks into fully functional and accessible user experiences.\nMaximize what is possible with JavaScript, CSS, and HTML in the browser.\nDrive our crew’s technical vision and implementation strategy\nMentor and empower your team members.\nCollaborate with the broader Engineering team on overall technical strategy, processes and frontend infrastructure.\n\nRequired Qualifications\n\nProficiency in building cross-browser, highly interactive web applications using JavaScript, HTML, and CSS\nComfortable with modern open source technologies and tools such as React\nFamiliarity with consuming RESTful APIs\n3+ years of commercial software development using React.\n6+ years of professional software development\nExperience architecting, building, and deploying mid-to-large size web applications\nDesire to learn, grow, lead and empower others\nStrong communication skills\n\nEqual Opportunity Statement\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of age, ancestry, citizenship, color, ethnicity, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or invisible disability status, political affiliation, veteran status, race, religion, or sexual orientation.\n\nDid you read the requirements as a checklist and not tick every box? Don't rule yourself out! If this role resonates with you, hit the ‘apply’ button.",
    "jobTitle": "Sr. Frontend Engineer",
    "company": "Ostron"
  }